In [1]:
import numpy as np

In [2]:
import pandas as pd

## random.randn(x,y)

In [4]:
data = np.random.randn(4,3)

In [5]:
data

array([[ 0.65972188, -0.12479104,  0.351886  ],
       [ 0.61847569,  0.65506085,  0.24869934],
       [-1.92780667,  0.81806697, -0.1857992 ],
       [ 0.44536429, -1.38376365,  0.8165482 ]])

In [6]:
# data.Series(data)
# AttributeError: 'numpy.ndarray' object has no attribute 'Series'

In [7]:
data_frame=pd.DataFrame(data)

In [8]:
data_frame

          0         1         2
0  0.659722 -0.124791  0.351886
1  0.618476  0.655061  0.248699
2 -1.927807  0.818067 -0.185799
3  0.445364 -1.383764  0.816548

In [9]:
type(data_frame)

pandas.core.frame.DataFrame

In [10]:
type(data_frame[0])

pandas.core.series.Series

In [11]:
new_df = pd.DataFrame(data, index=["Atil", "Zeynep", "Atlas", "Mehmet"], columns=["Salary", "Age", "Seniority"])

In [12]:
new_df

          Salary       Age  Seniority
Atil    0.659722 -0.124791   0.351886
Zeynep  0.618476  0.655061   0.248699
Atlas  -1.927807  0.818067  -0.185799
Mehmet  0.445364 -1.383764   0.816548

In [13]:
new_df["Salary"]

Atil      0.659722
Zeynep    0.618476
Atlas    -1.927807
Mehmet    0.445364
Name: Salary, dtype: float64

In [14]:
new_df[["Salary","Age"]]

          Salary       Age
Atil    0.659722 -0.124791
Zeynep  0.618476  0.655061
Atlas  -1.927807  0.818067
Mehmet  0.445364 -1.383764

## loc: get row with index name

In [16]:
new_df.loc["Atil"] # loc: get column with index name

Salary       0.659722
Age         -0.124791
Seniority    0.351886
Name: Atil, dtype: float64

## iloc: get ro with index(i)

In [18]:
new_df.iloc[0] # iloc: get row with index(i)

Salary       0.659722
Age         -0.124791
Seniority    0.351886
Name: Atil, dtype: float64

In [19]:
new_df

          Salary       Age  Seniority
Atil    0.659722 -0.124791   0.351886
Zeynep  0.618476  0.655061   0.248699
Atlas  -1.927807  0.818067  -0.185799
Mehmet  0.445364 -1.383764   0.816548

In [20]:
new_df.iloc[:,0] # : (all row),  0 (0. index column)

Atil      0.659722
Zeynep    0.618476
Atlas    -1.927807
Mehmet    0.445364
Name: Salary, dtype: float64

In [21]:
new_df.iloc[:,2]

Atil      0.351886
Zeynep    0.248699
Atlas    -0.185799
Mehmet    0.816548
Name: Seniority, dtype: float64

In [22]:
new_df["Extra"]=10

In [23]:
new_df

          Salary       Age  Seniority  Extra
Atil    0.659722 -0.124791   0.351886     10
Zeynep  0.618476  0.655061   0.248699     10
Atlas  -1.927807  0.818067  -0.185799     10
Mehmet  0.445364 -1.383764   0.816548     10

## drop

In [25]:
new_df.drop("Extra", axis=1) # 1: column, 0: row

          Salary       Age  Seniority
Atil    0.659722 -0.124791   0.351886
Zeynep  0.618476  0.655061   0.248699
Atlas  -1.927807  0.818067  -0.185799
Mehmet  0.445364 -1.383764   0.816548

In [26]:
new_df # Extra not reel drop

          Salary       Age  Seniority  Extra
Atil    0.659722 -0.124791   0.351886     10
Zeynep  0.618476  0.655061   0.248699     10
Atlas  -1.927807  0.818067  -0.185799     10
Mehmet  0.445364 -1.383764   0.816548     10

## inplace: for reel drop

In [28]:
new_df.drop("Extra", axis=1,inplace=True)

In [29]:
new_df

          Salary       Age  Seniority
Atil    0.659722 -0.124791   0.351886
Zeynep  0.618476  0.655061   0.248699
Atlas  -1.927807  0.818067  -0.185799
Mehmet  0.445364 -1.383764   0.816548

In [30]:
new_df["Mehmet"]=10

In [31]:
new_df

          Salary       Age  Seniority  Mehmet
Atil    0.659722 -0.124791   0.351886      10
Zeynep  0.618476  0.655061   0.248699      10
Atlas  -1.927807  0.818067  -0.185799      10
Mehmet  0.445364 -1.383764   0.816548      10

In [32]:
new_df.drop("Mehmet", axis=1,inplace=True)

In [33]:
new_df

          Salary       Age  Seniority
Atil    0.659722 -0.124791   0.351886
Zeynep  0.618476  0.655061   0.248699
Atlas  -1.927807  0.818067  -0.185799
Mehmet  0.445364 -1.383764   0.816548

In [34]:
new_df.drop("Mehmet", axis=0)

          Salary       Age  Seniority
Atil    0.659722 -0.124791   0.351886
Zeynep  0.618476  0.655061   0.248699
Atlas  -1.927807  0.818067  -0.185799

In [35]:
new_df

          Salary       Age  Seniority
Atil    0.659722 -0.124791   0.351886
Zeynep  0.618476  0.655061   0.248699
Atlas  -1.927807  0.818067  -0.185799
Mehmet  0.445364 -1.383764   0.816548

In [36]:
new_df.loc["Atlas"]

Salary      -1.927807
Age          0.818067
Seniority   -0.185799
Name: Atlas, dtype: float64

In [37]:
new_df.loc["Atlas"]["Salary"]

-1.9278066665725724

In [38]:
new_df.loc["Atlas","Salary"]

-1.9278066665725724

In [39]:
new_df.loc["Atlas","Salary"]=100

In [40]:
new_df

            Salary       Age  Seniority
Atil      0.659722 -0.124791   0.351886
Zeynep    0.618476  0.655061   0.248699
Atlas   100.000000  0.818067  -0.185799
Mehmet    0.445364 -1.383764   0.816548

In [41]:
new_df>0

        Salary    Age  Seniority
Atil      True  False       True
Zeynep    True   True       True
Atlas     True   True      False
Mehmet    True  False       True

In [42]:
boolean_frame=new_df>0

In [43]:
new_df[boolean_frame]

            Salary       Age  Seniority
Atil      0.659722       NaN   0.351886
Zeynep    0.618476  0.655061   0.248699
Atlas   100.000000  0.818067        NaN
Mehmet    0.445364       NaN   0.816548

In [44]:
new_df[new_df>0]

            Salary       Age  Seniority
Atil      0.659722       NaN   0.351886
Zeynep    0.618476  0.655061   0.248699
Atlas   100.000000  0.818067        NaN
Mehmet    0.445364       NaN   0.816548

In [45]:
new_df[new_df["Salary"]>1]

       Salary       Age  Seniority
Atlas   100.0  0.818067  -0.185799

In [46]:
new_df

            Salary       Age  Seniority
Atil      0.659722 -0.124791   0.351886
Zeynep    0.618476  0.655061   0.248699
Atlas   100.000000  0.818067  -0.185799
Mehmet    0.445364 -1.383764   0.816548

In [47]:
new_df[new_df["Age"]>0]

            Salary       Age  Seniority
Zeynep    0.618476  0.655061   0.248699
Atlas   100.000000  0.818067  -0.185799

In [48]:
new_df

            Salary       Age  Seniority
Atil      0.659722 -0.124791   0.351886
Zeynep    0.618476  0.655061   0.248699
Atlas   100.000000  0.818067  -0.185799
Mehmet    0.445364 -1.383764   0.816548

## reset_index()

In [50]:
reset_frame=new_df.reset_index()

In [51]:
reset_frame

    index      Salary       Age  Seniority
0    Atil    0.659722 -0.124791   0.351886
1  Zeynep    0.618476  0.655061   0.248699
2   Atlas  100.000000  0.818067  -0.185799
3  Mehmet    0.445364 -1.383764   0.816548

In [52]:
reset_frame.loc[0]

index            Atil
Salary       0.659722
Age         -0.124791
Seniority    0.351886
Name: 0, dtype: object

In [53]:
new_indeces=["Ati","Zey","Atl", "Meh"]

In [54]:
new_df["NewIndex"]=new_indeces

In [55]:
new_df

            Salary       Age  Seniority NewIndex
Atil      0.659722 -0.124791   0.351886      Ati
Zeynep    0.618476  0.655061   0.248699      Zey
Atlas   100.000000  0.818067  -0.185799      Atl
Mehmet    0.445364 -1.383764   0.816548      Meh

## set_index()

In [57]:
new_df.set_index("NewIndex", inplace=True)

In [58]:
new_df

              Salary       Age  Seniority
NewIndex
Ati         0.659722 -0.124791   0.351886
Zey         0.618476  0.655061   0.248699
Atl       100.000000  0.818067  -0.185799
Meh         0.445364 -1.383764   0.816548

In [59]:
new_df.loc["Ati"]

Salary       0.659722
Age         -0.124791
Seniority    0.351886
Name: Ati, dtype: float64

# Multi Index

In [61]:
first_index=["Simpson","Simpson","Simpson", "South Park","South Park","South Park"]

In [62]:
inner_index=["Homer","Bart","Marge", "Cartman","Kenny", "Kyle"]

In [63]:
zipped_index=list(zip(first_index, inner_index))

In [64]:
zipped_index

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [65]:
zipped_index= pd.MultiIndex.from_tuples(zipped_index)

In [66]:
zipped_index

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [67]:
sample_values=np.ones((6,2))

In [68]:
big_df=pd.DataFrame(sample_values,index=zipped_index, columns=["Age", "Salary"])

In [69]:
big_df

                    Age  Salary
Simpson    Homer    1.0     1.0
           Bart     1.0     1.0
           Marge    1.0     1.0
South Park Cartman  1.0     1.0
           Kenny    1.0     1.0
           Kyle     1.0     1.0

In [70]:
big_df["Age"]

Simpson     Homer      1.0
            Bart       1.0
            Marge      1.0
South Park  Cartman    1.0
            Kenny      1.0
            Kyle       1.0
Name: Age, dtype: float64

In [71]:
#big_df.loc["Homer"] #KeyError: 'Homer'

In [72]:
big_df.loc["Simpson"].loc["Homer"]

Age       1.0
Salary    1.0
Name: Homer, dtype: float64